Revit 2027 API
ParameterTypeId.RbsDuctRoutingPreferenceParam Property
 "Routing Preferences"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsDuctRoutingPreferenceParam { get; }
Public Shared ReadOnly Property RbsDuctRoutingPreferenceParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsDuctRoutingPreferenceParam {
	ForgeTypeId^ get ();
}
static member RbsDuctRoutingPreferenceParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace